{
  "articles": [
    {
      "id": 1,
      "author": "Ghifar Ramdhani",
      "img": "/img1.avif",
      "title": "The government shutdown is a slow-boil political crisis",
      "content": "It’s too early to blink, but the pressure is slowly beginning to rise.\nThe government shutdown drama is still in its opening act with Democrats and Republicans each heaping blame on the other side.\nAnd despite deepening partisan bitterness in Washington, nothing has changed the equation that led to the impasse: Republicans and Democrats both saw a greater political advantage in letting the government close than in keeping it open.\nBut the earliest signs were evident Wednesday of the political strains that will eventually crack the unity of one or both parties — whether it takes days or weeks — and end the standoff.\n\nDay One saw the rollout of initial battleground strategies:",
      "date": "2025-09-29"
    },
    {
      "id": 2,
      "author": "Ghifar Ramdhani",
      "img": "/img2.avif",
      "title": "China’s jobless youth aren’t happy with a plan to attract foreign professionals with a new ‘K-visa’",
      "content": "A new visa category launched by the Chinese government to attract young science and technology professionals is causing fervent backlash in China, where well-educated young people are already struggling to find work.\nDiscussion of the K-visa category has dominated social media discussion in recent days, where top-trending hashtags related to the visa have reached roughly half a billion views.\nMany voices pointed to deep-seated challenges faced by young jobseekers in China, where youth unemployment hovers close to 19% and a record 12.2 million new college graduates are competing for jobs in a tough economy.",
      "date": "2025-09-30"
    },
    {
      "id": 3,
      "author": "Ghifar Ramdhani",
      "img": "/img3.avif",
      "title": "Taylor Swift’s exes inspired some of her best work. Behold the heartbreak that came before Travis Kelce",
      "content": "Turns out Taylor Swift meant it when she sang about “never, ever getting back together.”Now that Travis Kelce has put a ring on it, the Swifties have been celebrating their girl finding her permanent guy, and saying to goodbye all the others for good.Well, maybe not for good, since any casual Swift listener (much less the Swifties) know All Too Well that a substantial portion of her past work was inspired by lost love, and/or love that just didn’t work out.",
      "date": "2025-10-01"
    },
    {
      "id": 4,
      "author": "Ghifar Ramdhani",
      "img": "/img4.avif",
      "title": "Meta will soon use your conversations with its AI chatbot to sell you stuff",
      "content": "New York -Meta will soon use what people tell its artificial intelligence chatbot to get even better at selling them things.The company said on Wednesday that users’ chats and interactions with Meta AI will soon be used to target them with even more personalized ads. Users will start seeing notices of the change next week, but it won’t kick in until December 16.Meta already targets users with ads based on what they post and click on, as well as who they’re connected to, on its social media platforms. That data enables Meta to infer what users might buy. But in conversations with Meta’s chatbot, users could directly tell the company about what they’re shopping for or the trip they’ll soon be packing for or what problems they have that a product could solve.The company will also use data from Meta AI to help decide what kinds of content users see on its site.",
      "date": "2025-10-01"
    },
    {
      "id": 5,
      "author": "Ghifar Ramdhani",
      "img": "/img5.avif",
      "title": "Hot dogs, camping trips and cardboard boxes: What these non-scientific indicators tell us about the economy",
      "content": "Gray’s Papaya hot dog restaurant in Manhattan has served up beef franks to the hungry and frugal masses for the past five decades.But the bustling business off 72nd and Broadway isn’t just an iconic New York City bastion for cheap eats — it also moonlights as an unofficial economic indicator.When hot dog sales there see a dramatic pickup — particularly the two-frank-and-tropical-drink “Recession Special” — it’s usually a signal that folks have fallen on harder times, owner Rachael Gray told CNN.",
      "date": "2025-10-01"
    },
    {
      "id": 6,
      "author": "Ghifar Ramdhani",
      "img": "/img6.avif",
      "title": "YouTube to reinstate accounts banned for posting false claims about Covid-19, 2020 election",
      "content": "New York — YouTube said Tuesday it plans to reinstate some accounts that it previously banned for violating rules against repeatedly posting misinformation about Covid-19 and the 2020 election.That announcement came in a letter sent by a lawyer for the platform’s parent company, Alphabet, to House Judiciary Committee Chairman Rep. Jim Jordan, in response to an investigation by Republicans into whether former President Joe Biden’s administration pressured big tech companies to remove certain types of content.",
      "date": "2025-10-01"
    },
    {
      "id": 7,
      "author": "Ghifar Ramdhani",
      "img": "/img7.avif",
      "title": "Google says 90% of tech workers are now using AI at work",
      "content": "New York — The overwhelming majority of tech industry workers use artificial intelligence on the job for tasks like writing and modifying code, a new Google study has found.The report, coming from Google’s DORA research division and based on 5,000 responses from technology professionals around the world, found that 90% of respondents are using AI in their job, up 14% from last year.The findings come as the rise of AI has prompted a mix of concern, hype and promise around how the technology could impact jobs and the economy. Anthropic CEO Dario Amodei made headlines in May when he said AI could lead to a spike in unemployment, a sentiment that other tech industry professionals have since tamped down. But some data does suggest﻿ it’s getting harder for entry-level workers to find jobs in software engineering, a trend that comes amid a wave of layoffs in the tech industry.",
      "date": "2025-10-01"
    },
    {
      "id": 8,
      "author": "Ghifar Ramdhani",
      "img": "/img8.avif",
      "title": "Black hole collision confirms decades-old predictions by Einstein and Hawking",
      "content": "Astronomers have detected a collision between two black holes in unprecedented detail, offering the clearest view yet into the nature of these cosmic oddities and confirming long-held predictions made by legendary physicists Albert Einstein and Stephen Hawking.The event, dubbed GW250114, became known in January when researchers spotted it with the Laser Interferometer Gravitational-Wave Observatory (LIGO) — a set of two identical instruments located in Livingston, Louisiana, and Hanford, Washington. The instruments detected gravitational waves, faint ripples in space-time produced by the two black holes slamming into each other.Searching for gravitational waves, phenomena predicted in 1915 as part of Einstein’s theory of relativity, is the only way to identify black hole collisions from Earth. Einstein believed that the waves would be too weak to ever be picked up by human technology, but in September 2015, LIGO recorded them for the very first time, later netting a Nobel Prize for three scientists who made key contributions to the development of this “black hole telescope.”",
      "date": "2025-10-01"
    },
    {
      "id": 9,
      "author": "Ghifar Ramdhani",
      "img": "/img9.avif",
      "title": "Earth’s core has slowed so much it’s moving backward, scientists confirm. Here’s what it could mean",
      "content": "Deep inside Earth is a solid metal ball that rotates independently of our spinning planet, like a top whirling around inside a bigger top, shrouded in mystery.This inner core has intrigued researchers since its discovery by Danish seismologist Inge Lehmann in 1936, and how it moves — its rotation speed and direction — has been at the center of a decades-long debate. A growing body of evidence suggests the core’s spin has changed dramatically in recent years, but scientists have remained divided over what exactly is happening — and what it means.Part of the trouble is that Earth’s deep interior is impossible to observe or sample directly. Seismologists have gleaned information about the inner core’s motion by examining how waves from large earthquakes that ping this area behave. Variations between waves of similar strengths that passed through the core at different times enabled scientists to measure changes in the inner core’s position and calculate its spin.",
      "date": "2025-10-01"
    },
    {
      "id": 10,
      "author": "Ghifar Ramdhani",
      "img": "/img10.webp",
      "title": "Southeast Asia is powering up for a clean energy future",
      "content": "Southeast Asia stands at a critical energy crossroads, on track to account for 25% of global energy demand growth between now and 2035.Surging consumption, intensifying climate risks, and growing concerns over energy security are pushing governments and energy players to rethink the regional energy mix, invest in cleaner alternatives, and establish long-term frameworks for cooperation and resilience.Regional institutions such as the ASEAN Center for Energy (ACE) coordinate policy, research and technical cooperation among member states to advance the energy transition, and eight ASEAN member countries have already set net-zero emissions goals. However, the region’s collective 15.6% renewable market share falls short of the goal of 23% by 2025, highlighting challenges in financing, grid infrastructure, and policy alignment.",
      "date": "2025-10-01"
    },
    {
      "id": 11,
      "author": "Ghifar Ramdhani",
      "img": "/img11.avif",
      "title": "New dinosaur species with striking sail-like back discovered",
      "content": "Paleontologists have discovered a new dinosaur species with a very distinctive feature, a sail-like structure running down its back, the Natural History Museum in London announced on Friday.The bones of Istiorachis macarthurae, named in honor of record-breaking British sailor Ellen MacArthur, were uncovered on the Isle of Wight, a small island just off the south coast of England, where it roamed more than 120 million years ago alongside other Iguanodon relatives — a group of herbivorous dinosaurs that lived from the Late Jurassic to Early Cretaceous periods.",
      "date": "2025-10-01"
    },
    {
      "id": 12,
      "author": "Ghifar Ramdhani",
      "img": "/img12.avif",
      "title": "AI is not yet replacing workers in the US, researchers find",
      "content": "ChatGPT is not yet causing the massive upheaval in the US labor market that many have feared since the chatbot’s launch in 2022, according to a new study by a research center at Yale University.The study comes amid widespread concerns that the proliferation of generative artificial intelligence, the technology that underpins ChatGPT, could put many jobs at risk as US companies increasingly turn to AI to cut costs through greater automation.",
      "date": "2025-10-01"
    },
    {
      "id": 13,
      "author": "Ghifar Ramdhani",
      "img": "/img13.avif",
      "title": "Warren Buffett’s Berkshire Hathaway set to make its biggest deal in three years",
      "content": "Berkshire Hathaway, the Warren Buffett-owned conglomerate, has announced its biggest deal in three years with the planned acquisition of OxyChem for $9.7 billion.This will be Buffett’s biggest deal since he paid $11.6 billion for Alleghany, an insurance company, in 2022. Buffett, 95, recently announced he was stepping down as CEO at the end of the year.",
      "date": "2025-10-01"
    },
    {
      "id": 14,
      "author": "Ghifar Ramdhani",
      "img": "/img14.avif",
      "title": "Dow, S&P 500 hit record highs as Wall Street shrugs off government shutdown concerns for now",
      "content": "Stocks closed slightly higher on Wednesday as the US government officially entered a shutdown and Wall Street grappled with the uncertain implications for the economy.The Dow rose 43 points, or 0.09%. The broader S&P 500 rose 0.34% and the tech-heavy Nasdaq Composite rose 0.42%. The S&P 500 and Dow both closed at record highs.",
      "date": "2025-10-01"
    },
    {
      "id": 15,
      "author": "Ghifar Ramdhani",
      "img": "/img15.avif",
      "title": "A new rule means some 401(k) contributions will no longer be tax-deferred. Here’s who will be affected",
      "content": "A new rule is going into effect next year that will affect high earners who make “catch-up contributions” in their 401(k)s or other tax-deferred workplace retirement plans.The rule, which was created under the Secure 2.0 retirement law, will essentially eliminate the immediate tax break for catch-up contributions that you get for the bulk of your other contributions to a 401(k) — or 403(b), 457(b), Simplified Employee Pension Plan (SEP) or SIMPLE IRA.",
      "date": "2025-10-01"
    },
    {
      "id": 16,
      "author": "Ghifar Ramdhani",
      "img": "/img16.avif",
      "title": "China’s internet censors have a new target: pessimists",
      "content": "China’s powerful internet censors have long been known for erasing political dissent, vitriol against the Communist Party leadership, and mention of sensitive historical events. Now, they’re being unleashed on a new scourge – negativity.The country’s internet regulator on Monday unveiled a two-month nationwide campaign aimed at curbing pessimism trending on social media, live-streaming and short-video platforms.",
      "date": "2025-10-01"
    },
    {
      "id": 17,
      "author": "Ghifar Ramdhani",
      "img": "/img17.avif",
      "title": "Amazon to pay historic $2.5 billion settlement for allegedly tricking customers into signing up for Prime",
      "content": "Amazon is paying a historic $2.5 billion settlement with the Federal Trade Commission, the agency announced Thursday, ending a two-year dispute over allegations the company tricked consumers into signing up for its Prime subscription service and then made it hard to cancel.As part of the agreement, Amazon will pay a $1 billion civil penalty and provide $1.5 billion in refunds to an estimated 35 million customers that were “harmed by their deceptive Prime enrollment practices,” the agency said in a press release.",
      "date": "2025-10-01"
    },
    {
      "id": 18,
      "author": "Ghifar Ramdhani",
      "img": "/img18.avif",
      "title": "As the US government hits pause, Trump’s economic chaos only accelerates ",
      "content": "Giant tariffs are up in the air, once again. No official economic data will come out during the government shutdown. And once the business of the US government does resume, it’s anyone’s guess who the president will tap to run the Bureau of Labor Statistics now that the administration has been forced to claw back its disastrous first pick.",
      "date": "2025-10-01"
    },
    {
      "id": 19,
      "author": "Ghifar Ramdhani",
      "img": "/img19.webp",
      "title": "Rare ‘tooth-in-eye’ surgery restores man’s vision after two decades",
      "content": "The procedure, also known as tooth-in-eye or osteo-odonto-keratoprosthesis, involves removing a patient’s tooth, sewing a piece of it into the cheek and placing the structure into their eye.“It’s a situation where a standard corneal transplant simply won’t work,” said Dr. Vicente Diaz, assistant professor of ophthalmology and visual science at the Yale School of Medicine. Diaz was not involved with Chapman’s case but treats people who have Stevens-Johnson syndrome, the rare and sometimes fatal drug reaction that caused Chapman’s blindness.",
      "date": "2025-10-01"
    },
    {
      "id": 20,
      "author": "Ghifar Ramdhani",
      "img": "/img20.webp",
      "title": "What is the heliosphere? A new mission could unravel the mysteries of this complex cosmic environment",
      "content": "The spacecraft’s 10 instruments will also fill gaps in the existing map of the heliosphere, pieced together from data collected by previous missions, and help further explain how the heliosphere largely shields our solar system from damaging cosmic rays, the most highly energetic particles in the universe.Along with two other space weather missions that lifted off aboard the same rocket on Wednesday, IMAP will help scientists better predict when solar storms unleashed by the sun could affect our planet. When aimed at Earth, harsh radiation from the storms, also known as space weather, can pose risks to astronauts on the International Space Station as well as interfere with communications, the electric power grid, navigation, and radio and satellite operations.",
      "date": "2025-10-01"
    }
  ]
}
